run/fallingDrop/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interLBDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1e-2;//7e-6;//1e-5;


deltaT          1e-9;

writeControl    adjustableRunTime;
/*writeControl    timeStep; //timeStep*/

writeInterval   5e-7;
/*writeInterval   1;*/

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.01;
maxAlphaCo      0.01;

maxDeltaT       1;

libs
(
    "libbalancedRefinementFvMesh.so"
);

// ************************************************************************* //
