run/fallingDrop/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    pd
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.05;
    }

/*    pcorr*/
/*    {*/
/*        solver          PCG;*/
/*        preconditioner*/
/*        {*/
/*            preconditioner  GAMG;*/
/*            tolerance       0.0001;*/
/*            relTol          0;*/
/*            smoother        GaussSeidel;*/
/*            nPreSweeps      1;*/
/*            nPostSweeps     2;*/
/*            nFinestSweeps   2;*/
/*            cacheAgglomeration false;*/
/*            nCellsInCoarsestLevel 5;*/
/*            agglomerator    algebraicPair;*/
/*            mergeLevels     1;*/
/*        }*/

/*        tolerance       1e-5;*/
/*        relTol          0;*/
/*        maxIter         100;*/
/*    }*/
/*    */

    pcorrFinal
    {
        $pcorr;
        tolerance       0;
    }

/*    pd*/
/*    {*/
/*        solver          GAMG;*/
/*        tolerance       1e-08;*/
/*        relTol          0.01;*/
/*        smoother        GaussSeidel;*/
/*        nPreSweeps      0;*/
/*        nPostSweeps     2;*/
/*        nFinestSweeps   2;*/
/*        cacheAgglomeration false;*/
/*        nCellsInCoarsestLevel 10;*/
/*        agglomerator    algebraicPair;*/
/*        mergeLevels     1;*/
/*    }*/

/*    pdFinal*/
/*    {*/
/*        solver          PCG;*/
/*        preconditioner*/
/*        {*/
/*            preconditioner  GAMG;*/
/*            tolerance       1e-09;*/
/*            relTol          0;*/
/*            nVcycles        2;*/
/*            smoother        GaussSeidel;*/
/*            nPreSweeps      0;*/
/*            nPostSweeps     2;*/
/*            nFinestSweeps   2;*/
/*            cacheAgglomeration false;*/
/*            nCellsInCoarsestLevel 10;*/
/*            agglomerator    algebraicPair;*/
/*            mergeLevels     1;*/
/*        }*/

/*        tolerance       1e-10;*/
/*        relTol          0;*/
/*        maxIter         30;*/
/*    }*/

    pdFinal
    {
        $pd;
        tolerance       0;
    }


    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0;
        nSweeps         1;
    }

    "(k|B|nuTilda)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
}

PISO
{
    cAlpha 1.;
}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;

    nAlphaCorr      2;
    nAlphaSubCycles 1;

    pdRefPoint      (0 0.003 0.003);
    pdRefValue      0;
    pRefPoint       (0 0.003 0.003);
    pRefValue       0;
}


// ************************************************************************* //
